kAMDSuccess = "Tidak ada kesalahan.";
kAMDUndefinedError = "Terjadi kesalahan yang tidak diketahui.";
kAMDBadHeaderError = "Tidak dapat mentransfer file.";
kAMDNoResourcesError = "Tidak dapat mengalokasikan sumber daya.";
kAMDReadError = "Tidak dapat membaca dari perangkat.";
kAMDWriteError = "Tidak dapat menulisi perangkat.";
kAMDUnknownPacketError = "Paket tidak dikenal.";
kAMDInvalidArgumentError = "Argumen tidak sah.";
kAMDNotFoundError = "File tidak dapat ditemukan.";
kAMDIsDirectoryError = "Jalur adalah direktori.";
kAMDPermissionError = "Anda tidak memiliki izin.";
kAMDNotConnectedError = "Tidak terhubung ke perangkat.";
kAMDTimeOutError = "Operasi kehabisan waktu.";
kAMDOverrunError = "Ada kelebihan buffer.";
kAMDEOFError = "Akhir file.";
kAMDUnsupportedError = "Operasi ini tidak didukung.";
kAMDFileExistsError = "File sudah ada.";
kAMDBusyError = "Perangkat sedang sibuk.";
kAMDCryptoError = "Tidak dapat membuat koneksi aman ke perangkat.";
kAMDTooBigError = "Pesan terlalu besar.";
kAMDInvalidResponseError = "Menerima respons yang tidak terduga dari perangkat.";
kAMDMissingKeyError = "Kehilangan kunci.";
kAMDMissingValueError = "Kehilangan nilai.";
kAMDGetProhibitedError = "Tidak bisa mendapatkan kembali nilai dari alat yang dikunci kode sandi.";
kAMDSetProhibitedError = "Tidak dapat mengatur nilai pada perangkat.";
kAMDRemoveProhibitedError = "Tidak dapat menghapus nilai pada perangkat.";
kAMDImmutableValueError = "Nilai tidak dapat diganti.";
kAMDPasswordProtectedError = "Perangkat ini dilindungi kode sandi.";
kAMDMissingHostIDError = "Perangkat tidak mengenali host ini.";
kAMDInvalidHostIDError = "Perangkat tidak mengenali host ini.";
kAMDSessionActiveError = "Sesi sedang aktif.";
kAMDSessionInactiveError = "Sesi sedang tidak aktif.";
kAMDMissingSessionIDError = "Kehilangan ID Sesi.";
kAMDInvalidSessionIDError = "ID sesi tidak sah.";
kAMDMissingServiceError = "Kehilangan layanan.";
kAMDInvalidServiceError = "Layanan tidak sah.";
kAMDServiceLimitError = "Terlalu banyak contoh layanan ini yang sudah berjalan.";
kAMDCheckinSetupFailedError = "Tidak dapat memulai layanan pada perangkat";
kAMDInvalidCheckinError = "Tidak dapat memulai layanan pada perangkat";
kAMDCheckinTimeoutError = "Layanan tidak dimulai dengan baik pada perangkat. ";
kAMDCheckinConnectionFailedError = "Layanan tidak dimulai dengan baik pada perangkat.";
kAMDCheckinReceiveFailedError = "Layanan tidak dimulai dengan baik pada perangkat. ";
kAMDCheckinResponseFailedError = "Layanan tidak dimulai dengan baik pada perangkat. ";
kAMDCheckinOutOfMemoryError = "Layanan tidak dimulai dengan baik pada perangkat. ";
kAMDCheckinSendFailedError = "Layanan tidak dimulai dengan baik pada perangkat. ";
kAMDMissingPairRecordError = "Host tidak dipasangkan dengan perangkat.";
kAMDInvalidPairRecordError = "Host tidak lagi dipasang dengan perangkat.";
kAMDSavePairRecordFailedError = "Tidak dapat menyimpan catatan pemasangan.";
kAMDInvalidActivationRecordError = "Catatan aktivasi tidak berlaku.";
kAMDMissingActivationRecordError = "Catatan aktivasi tidak dapat ditemukan.";
kAMDServiceProhibitedError = "Layanan tidak dapat dimulai pada perangkat.";
kAMDEscrowLockedError = "Perangkat tidak tersedia hingga membuka kunci pertama setelah boot.";
kAMDProhibitedBySupervision = "Operasi dilarang di perangkat yang diawasi.";
kAMDPairingProhibitedError = "Pemasangan hanya dizinkan melalui USB.";
kAMDWrongDroidError = "Perangkat sedang dalam mode pemulihan.";
kAMDSUVerificationError = "Paket pembaruan perangkat lunak tidak dapat diverifikasi.";
kAMDSUPatchError = "Tidak dapat menambal file.";
kAMDSUFirmwareError = "Tidak dapat menyoroti firmware.";
kAMDProvisioningProfileNotValid = "Profil penyedia tidak berlaku.";
kAMDSendMessageError = "Tidak dapat mengirim pesan ke perangkat.";
kAMDReceiveMessageError = "Tidak dapat menerima pesan dari perangkat.";
kAMDMissingOptionsError = "Pilihan menghilang.";
kAMDMissingImageTypeError = "Kehilangan gambar.";
kAMDDigestFailedError = "Tidak dapat membaca gambar disk.";
kAMDStartServiceError = "Layanan tidak dapat dimulai.";
kAMDInvalidDiskImageError = "Gambar disk tidak sah.";
kAMDMissingDigestError = "Digest tidak ditemukan.";
kAMDMuxError = "Ada kesalahan dengan perangkat USB multiplexor.";
kAMDApplicationAlreadyInstalledError = "Aplikasi sistem dengan pengenal paket yang diberikan sudah diinstal pada perangkat dan tidak dapat diganti.";
kAMDApplicationMoveFailedError = "Aplikasi tidak dapat dipindahkan ke suatu tempat pada perangkat.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Aplikasi tidak dapat disandbox.";
kAMDApplicationVerificationFailedError = "Aplikasi tidak dapat diverifikasi.";
kAMDArchiveDestructionFailedError = "Tidak dapat menghapus arsip aplikasi.";
kAMDBundleVerificationFailedError = "Paket operator tidak dapat diverifikasi.";
kAMDCarrierBundleCopyFailedError = "Tidak dapat menginstal paket operator.";
kAMDCarrierBundleDirectoryCreationFailedError = "Tidak dapat membuat direktori paket operator.";
kAMDCarrierBundleMissingSupportedSIMsError = "Tidak ada SIM yang didukung untuk paket operator ini.";
kAMDCommCenterNotificationFailedError = "Tidak dapat mendengarkan pemberitahuan dari pita dasar.";
kAMDContainerCreationFailedError = "Tidak dapat membuat wadah aplikasi.";
kAMDContainerP0wnFailedError = "Tidak dapat memperbaiki izin di wadah aplikasi.";
kAMDContainerRemovalFailedError = "Tidak dapat menghapus wadah aplikasi.";
kAMDEmbeddedProfileInstallFailedError = "Tidak dapat menginstal profil penyedia yang terlekatkan.";
kAMDErrorError = "Terjadi kesalahan.";
kAMDExecutableTwiddleFailedError = "Tidak dapat mengubah izin yang dapat dieksekusi pada aplikasi.";
kAMDExistenceCheckFailedError = "Tidak dapat memeriksa apakah aplikasi sudah ada.";
kAMDInstallMapUpdateFailedError = "Tidak dapat memperbarui daftar aplikasi terinstal.";
kAMDManifestCaptureFailedError = "Tidak dapat menyimpan manifestasi aplikasi.";
kAMDMapGenerationFailedError = "Tidak dapat membuat peta.";
kAMDMissingBundleExecutableError = "Paket aplikasi tidak memiliki berkas yang dapat dieksekusi.";
kAMDMissingBundleIdentifierError = "Paket aplikasi tidak memiliki pengenal yang sah.";
kAMDMissingBundlePathError = "Tidak dapat menentukan jalur paket aplikasi.";
kAMDMissingContainerError = "Tidak dapat menemukan kontainer untuk aplikasi terinstal.";
kAMDNotificationFailedError = "Tidak dapat membuat pemberitahuan.";
kAMDPackageExtractionFailedError = "Tidak dapat membuka paket aplikasi.";
kAMDPackageInspectionFailedError = "Tidak dapat memeriksa paket aplikasi.";
kAMDPackageMoveFailedError = "Tidak dapat memindahkan paket aplikasi ke lokasi staging.";
kAMDPathConversionFailedError = "Tidak dapat mengganti jalur.";
kAMDRestoreContainerFailedError = "Tidak dapat mengembalikan wadah aplikasi.";
kAMDSeatbeltProfileRemovalFailedError = "Tidak dapat memindahkan profil sabuk pengaman.";
kAMDStageCreationFailedError = "Tidak dapat membuat direktori staging.";
kAMDSymlinkFailedError = "Tidak dapat membuat symlink.";
kAMDiTunesArtworkCaptureFailedError = "Tidak dapat menyimpan karya seni iTunes.";
kAMDiTunesMetadataCaptureFailedError = "Tidak dapat menyimpan metadata iTunes.";
kAMDAlreadyArchivedError = "Aplikasi telah diarsipkan.";
kAMDUnknownCommandError = "Perangkat tidak mengenali perintah.";
kAMDAPIInternalError = "Kesalahan API internal.";
kAMDMuxCreateListenerError = "Tidak dapat mendengarkan perangkat USB.";
kAMDMuxGetListenerError = "Tidak bisa mendapatkan pendengar USB.";
kAMDMuxConnectError = "Tidak dapat terhubung ke perangkat.";
kAMDDeviceTooNewError = "Aplikasi perlu diperbarui.";
kAMDDeviceRefNoGood = "Perangkat ini tidak lagi tersambung.";
kAMDDeviceDisconnectedError = "Perangkat ini tidak lagi tersambung.";
kAMDCannotTranslateError = "Tidak dapat menerjemahkan pesan dari perangkat";
kAMDMobileImageMounterMissingImageSignature = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterResponseCreationFailed = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterMissingImageType = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterMissingImagePath = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterImageMapLoadFailed = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterAlreadyMounted = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterImageMoveFailed = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterMountPathMissing = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterMountPathNotEmpty = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterImageMountFailed = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterDigestFailed = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterDigestCreationFailed = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterImageVerificationFailed = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterImageInfoCreationFailed = "Tidak dapat mendukung pengembangan.";
kAMDMobileImageMounterImageMapStoreFailed = "Tidak dapat mendukung pengembangan.";
kAMDDeviceOSVersionTooLow = "Versi OS alat terlalu rendah.";
kAMDNoWifiSyncSupportError = "Perangkat tidak mendukung penyelarasan nirkabel.";
kAMDDeviceFamilyNotSupported = "Aplikasi ini tidak mendukung jenis perangkat ini.";
kAMDPackagePatchFailedError = "Tidak dapat menerapkan pembaruan patch ke aplikasi.";
kAMDIncorrectArchitectureError = "Aplikasi ini tidak mendukung tipe CPU perangkat ini.";
kAMDPluginCopyFailedError = "Tidak dapat menyalin Plugin VPN ke wadah aplikasi.";
kAMDBreadcrumbFailedError = "Tidak dapat menulis breadcrumb instalasi.";
kAMDBreadcrumbUnlockError = "Tidak dapat memperbarui breadcrumb instalasi.";
kAMDGeoJSONCaptureFailedError = "Tidak dapat menyimpan data GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "Tidak dapat menyimpan karya seni Kios.";
kAMDMissingCommandError = "Permintaan tidak berisi perintah.";
kAMDNotEntitledError = "Aplikasi yang meminta tidak diizinkan untuk membuat permintaan ini.";
kAMDMissingPackagePathError = "Permintaan kehilangan path paket.";
kAMDMissingContainerPathError = "Permintaan kehilangan path wadah.";
kAMDMissingApplicationIdentifierError = "Permintaan kehilangan pengidentifikasi aplikasi.";
kAMDMissingAttributeValueError = "Permintaan kehilangan nilai yang diperlukan.";
kAMDLookupFailedError = "Tidak dapat mendaftar aplikasi terinstal.";
kAMDDictCreationFailedError = "Tidak dapat mengekstrak kemampuan dari permintaan.";

/* kMISFileError */
"A file operation failed." = "Operasi file gagal.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Sumber daya yang ditandatangani telah ditambah, dimodifikasi, atau dihapus.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Profil penyedia yang sah untuk berkas yang dapat dieksekusi ini tidak ditemukan.";

/* kMISUnknownError */
"An unknown error has occurred." = "Terjadi kesalahan yang tidak diketahui.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Berusaha memodifikasi profil penyedia yang tetap.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Aplikasi tidak memiliki tanda tangan yang sah.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Tanda tangan aplikasi sah tapi tidak cocok dengan hash yang diharapkan.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "File yang dapat dieksekusi berisi tanda tangan yang tidak sah.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "File yang dapat dieksekusi ditandatangani dengan pemberian hak yang tidak sah.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "Identitas yang digunakan untuk menandatangani berkas tereksekusi tidak sah lagi.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Tanda tangan tidak sah.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Terjadi kesalahan saat berkomunikasi dengan perangkat Anda.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Profil penyedia tidak dapat diinstal pada perangkat ini.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Profil penyedia ini tidak memiliki tanda tangan yang sah (atau memiliki tanda tangan sah, tapi tidak tepercaya).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Profil penyedia ini telah kedaluwarsa.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Profil penyedia ini cacat.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Profil penyedia ini tidak didukung.";

/* kMISAllocationError */
"Unable to allocate memory." = "Tidak dapat mengalokasikan memori .";

